
&НаСервере
Процедура ДобавитьМатериалыНаСервере()
	Объект.Материалы.Очистить(); 
	Для каждого ТекущаяСтрока Из Объект.Продукция Цикл
		Спецификация = ТекущаяСтрока.Спецификация.ПолучитьОбъект();
		ТаблицаСпецификации = Спецификация.Материалы.Выгрузить();
		//Цикл внутри спецификации
		Для каждого ТекущаяСтрокаСпецификации Из ТаблицаСпецификации Цикл
		НоваяСтрокаПродукции =  Объект.Материалы.Добавить();
		НоваяСтрокаПродукции.Номенклатура = ТекущаяСтрокаСпецификации.Номенклатура;
		НоваяСтрокаПродукции.Количество = ТекущаяСтрокаСпецификации.Количество * ТекущаяСтрока.Количество;
		//НоваяСтрокаПродукции.Записать();
		КонецЦикла;
		//Конец цикла внутри спецификации
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериалы(Команда)
	ДобавитьМатериалыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	УпорядочитьТаблицуПоТипамМатериалы();
	УпорядочитьТаблицуПоТипамПродукция();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УпорядочитьТаблицуПоТипамМатериалы()
	Тб=Объект.Материалы.Выгрузить();
	Тб.Колонки.Добавить("Порядок");
	Для Каждого Стр из Тб Цикл
		Стр.Порядок=0+Стр.Номенклатура.Тип.ПорядокОтображения;
	КонецЦикла;
	Тб.Сортировать("Порядок ВОЗР");
	Объект.Материалы.Загрузить(Тб);
КонецПроцедуры

&НаСервере
Процедура УпорядочитьТаблицуПоТипамПродукция()
	Тб=Объект.Продукция.Выгрузить();
	Тб.Колонки.Добавить("Порядок");
	Для Каждого Стр из Тб Цикл
		Стр.Порядок=0+Стр.Номенклатура.Тип.ПорядокОтображения;
	КонецЦикла;
	Тб.Сортировать("Порядок ВОЗР");
	Объект.Продукция.Загрузить(Тб);
КонецПроцедуры

&НаКлиенте
Процедура Анализ(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокСсылка", Объект.Ссылка); 
	ОткрытьФорму("Обработка.АнализОстатков.Форма", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПродукцияНоменклатураПриИзмененииНаСервере(Номенклатура)
	ИскНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура);
	Спецификация = ИскНоменклатура.ОсновнаяСпецификация.Ссылка;
	Возврат Спецификация;
КонецФункции

&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	Номенклатура = ТекСтрока.Номенклатура;

	ТекСтрока.Спецификация = ПродукцияНоменклатураПриИзмененииНаСервере(Номенклатура);
КонецПроцедуры
