
&НаКлиенте
Процедура ТоварыОтклонениеПриИзменении(Элемент)
	ТекДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекДанные.Отклонение = ТекДанные.КоличествоФакт - ТекДанные.КоличествоУчет;
КонецПроцедуры

&НаСервере
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(, Склад = &СкладДокумента) КАК ОстаткиНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("СкладДокумента", Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОстатков  = РезультатЗапроса.Выгрузить();
	ТекНоменклатура = ТаблицаОстатков.Найти(Номенклатура, "Номенклатура");
	Количество = ТекНоменклатура.КоличествоОстатка;
	
	Возврат Количество;
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Количество = 0;
	//Количество = ТоварыНоменклатураПриИзмененииНаСервере(Элемент);
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.КоличествоФакт = Количество;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоОстаткамНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(, Склад = &СкладДокумента) КАК ОстаткиНоменклатурыОстатки";
	
	//Граница = Новый Граница(МоментВремени(), ВидГраницы.Исключая);	
	//Запрос.УстановитьПараметр("Дата", Граница);
	Запрос.УстановитьПараметр("СкладДокумента", Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОстатков  = РезультатЗапроса.Выгрузить();
	
	Для каждого Строка из ТаблицаОстатков Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.КоличествоФакт = Строка.КоличествоОстаток;
		НоваяСтрока.КоличествоУчет = Строка.КоличествоОстаток;
	КонецЦикла;	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ЗаполнитьПоОстаткамНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	УпорядочитьТаблицуПоТипам();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

Процедура УпорядочитьТаблицуПоТипам()
	Тб=Объект.Товары.Выгрузить();
	Тб.Колонки.Добавить("Порядок");
	Для Каждого Стр из Тб Цикл
		Стр.Порядок=0+Стр.Номенклатура.Тип.ПорядокОтображения;
	КонецЦикла;
	Тб.Сортировать("Порядок ВОЗР");
	Объект.Товары.Загрузить(Тб);
КонецПроцедуры
